const markdownText = `
*如果您觉得本人维护的开源项目对您有用，可以考虑通过捐赠来支持本项目。*

#免责声明
1. 网站需要维护费用——域名&服务器，请大家多多支持；
2. 本项目因为喜欢研究游戏不明觉厉的数据才开发维护该开源项目，不以盈利为目的，是个人维护的独立项目；
3. 捐赠者的捐赠行为完全自愿，本人与各捐赠者之间不构成购买或雇佣关系；

#捐赠注意
1. *对于无独立经济来源的学生或未成人不推荐进行任何捐赠!!*
2. *仅支持微信捐赠（不可退款）。*

# 捐赠金额公示
1. 24年1月 ¥110
2. 24年2月 ¥106.66

# 近期更新计划
1. 宝可梦盒子
2. 队伍日产/周产

# 特别鸣谢
1. 岛屿只数区间表 by @skysland
2. [睡姿期望相关](https://nga.178.com/read.php?tid=39443018) by @samuelwyf
3. 食材率&技能率等数据来源自[Pokémon Sleep 攻略站](https://pks.raenonx.cc/)
`
export default markdownText