import { map1ScoreList } from './scoreLine.js'
/*
 * 万圣限定 426, 94, 911, 9001, 9005
 * 圣诞限定 364, 365, 459, 460, 922, 923, 7006, 7007, 9002, 9004
*/
export default {
  // name: '萌绿之岛',
  id: 'green',
  pic: 'map1',
  berry: ['?', '?', '?'],
  scoreList: map1ScoreList,
  levelList: [
    {
      'name': '普通1',
      'nameIndex': 1,
      'nameId': 1,
      'energy': 0,
      'sleepStyles': [
        '19-id-1',
        '172-id-1',
        '10-id-1',
        '50-id-1',
        '175-id-1',
        '74-id-1',
        '23-id-1',
        '104-id-1',
        '56-id-1',
        '69-id-1',
        '174-id-1',
        '179-id-1',
        '84-id-1',
        '92-id-1',
        '333-id-1',
        '360-id-1',
        '438-id-1',
        '453-id-1',
        '81-id-1',
        '363-id-1'
        // '9001-id-1',
        // '9005-id-1'
      ]
    },
    {
      'name': '普通2',
      'nameIndex': 2,
      'nameId': 1,
      'energy': 3118,
      'sleepStyles': [
        '52-id-1',
        '1-id-1',
        '7-id-1',
        '4-id-1',
        '79-id-1',
        '158-id-1',
        '155-id-1',
        '58-id-1',
        '54-id-1',
        '152-id-1',
        '316-id-1',
        '287-id-1',
        '228-id-1',
        '173-id-1'
        // '459-id-1' // 圣诞佳节限定
      ]
    },
    {
      'name': '普通3',
      'nameIndex': 3,
      'nameId': 1,
      'energy': 7171,
      'sleepStyles': [
        '25-id-1',
        '185-id-1',
        '447-id-1'
        // '9002-id-1' // 圣诞佳节限定
      ]
    },
    {
      'name': '普通4',
      'nameIndex': 4,
      'nameId': 1,
      'energy': 11693,
      'sleepStyles': [
        '133-id-1',
        '39-id-1',
        '202-id-1',
        '246-id-1',
        '35-id-1'
        // '280-id-1' // 新年2025限定1，拉鲁拉斯
      ]
    },
    {
      'name': '普通5',
      'nameIndex': 5,
      'nameId': 1,
      'energy': 17149,
      'sleepStyles': [
        '19-id-2',
        '172-id-2',
        '10-id-2',
        '50-id-2',
        '175-id-2',
        '74-id-2',
        '23-id-2',
        '104-id-2',
        '56-id-2',
        '69-id-2',
        '174-id-2',
        '179-id-2',
        '84-id-2',
        '92-id-2',
        '333-id-2',
        '360-id-2',
        '438-id-2',
        '453-id-2',
        '81-id-2',
        '363-id-2'
        // '9004-id-1', // 圣诞佳节限定
        // '147-id-1' // 新年2025限定1，迷你龙
      ]
    },
    {
      'name': '超级1',
      'nameIndex': 1,
      'nameId': 2,
      'energy': 23385,
      'sleepStyles': [
        '19-id-4',
        '52-id-2',
        '172-id-4',
        '1-id-2',
        '10-id-4',
        '11-id-1',
        '7-id-2',
        '4-id-2',
        '79-id-2',
        '158-id-2',
        '175-id-4',
        '74-id-4',
        '23-id-4',
        '104-id-4',
        '155-id-2',
        '58-id-2',
        '56-id-4',
        '69-id-4',
        '174-id-4',
        '179-id-4',
        '54-id-2',
        '84-id-4',
        '152-id-2',
        '316-id-2',
        '333-id-4',
        '360-id-4',
        '438-id-4',
        '453-id-4',
        '287-id-2',
        '363-id-4',
        '228-id-2',
        '173-id-2',
        '353-id-1',
        '37-id-1',
        '906-id-1',
        '909-id-1',
        '912-id-1',
        '194-id-1',
        '921-id-1',
        '627-id-1',
        '517-id-1',
        '440-id-1',
        '252-id-1',
        '255-id-1',
        '258-id-1',
        '848-id-1',
        '177-id-1',
        '710-id-1'
        // '459-id-2' // 圣诞佳节限定
      ]
    },
    {
      'name': '超级2',
      'nameIndex': 2,
      'nameId': 2,
      'energy': 31492,
      'sleepStyles': [
        '25-id-2',
        '52-id-4',
        '1-id-4',
        '7-id-4',
        '4-id-4',
        '158-id-4',
        '155-id-4',
        '58-id-4',
        '70-id-1',
        '185-id-2',
        '54-id-4',
        '105-id-1',
        '152-id-4',
        '180-id-1',
        '316-id-4',
        '317-id-1',
        '454-id-1',
        '82-id-1',
        '447-id-2',
        '228-id-4',
        '7054-id-1'
        // '371-id-1', //7岛首次限时出现
        // '557-id-1', //7岛首次限时出现
        // '328-id-1' //7岛首次限时出现
        // '9005-id-2',
        // '7006-id-1'
        // '759-id-1' // 新年2025限定1，童偶熊
        // '9002-id-2', // 圣诞佳节限定
        // '364-id-1' // 圣诞佳节限定
        // '304-id-1', // 新年2025限定2
        // '403-id-1', // 新年2025限定2
        // '736-id-1' // 新年2025限定2
        // '9001-id-2'
      ]
    },
    {
      'name': '超级3',
      'nameIndex': 3,
      'nameId': 2,
      'energy': 41314,
      'sleepStyles': [
        '25-id-4',
        '133-id-2',
        '39-id-2',
        '75-id-1',
        '202-id-2',
        '246-id-2',
        '288-id-1',
        '447-id-4',
        '35-id-2',
        '425-id-1'
        // '280-id-2' // 新年2025限定1，拉鲁拉斯
      ]
    },
    {
      'name': '超级4',
      'nameIndex': 4,
      'nameId': 2,
      'energy': 53006,
      'sleepStyles': [
        '133-id-4',
        '2-id-1',
        '39-id-4',
        '8-id-1',
        '5-id-1',
        '24-id-1',
        '20-id-1',
        '93-id-1',
        '57-id-1',
        '176-id-1',
        '246-id-4',
        '153-id-1',
        '156-id-1',
        '159-id-1'
        // '9004-id-2',// 圣诞佳节限定
        // '147-id-2', // 新年2025限定1，迷你龙
        // '280-id-4' // 新年2025限定1，拉鲁拉斯
      ]
    },
    {
      'name': '超级5',
      'nameIndex': 5,
      'nameId': 2,
      'energy': 65634,
      'sleepStyles': [
        '11-id-2',
        '51-id-1',
        '85-id-1',
        '132-id-1',
        '353-id-2',
        '37-id-2',
        '906-id-2',
        '909-id-2',
        '912-id-2',
        '194-id-2',
        '921-id-2',
        '627-id-2',
        '517-id-2',
        '440-id-2',
        '252-id-2',
        '255-id-2',
        '258-id-2',
        '848-id-2',
        '177-id-2',
        '710-id-2'
      ]
    },
    {
      'name': '高级1',
      'nameIndex': 1,
      'nameId': 3,
      'energy': 79197,
      'sleepStyles': [
        '11-id-4',
        '79-id-4',
        '70-id-2',
        '185-id-4',
        '80-id-1',
        '105-id-2',
        '180-id-2',
        '202-id-4',
        '317-id-2',
        '454-id-2',
        '53-id-1',
        '81-id-3',
        '82-id-2',
        '287-id-4',
        '363-id-3',
        '173-id-4',
        '35-id-4',
        '906-id-4',
        '909-id-4',
        '912-id-4',
        '440-id-4',
        // '304-id-2', // 新年2025限定2
        // '403-id-2', // 新年2025限定2
        // '736-id-2', // 新年2025限定2
        '215-id-1',
        // '7006-id-2',
        '921-id-4',
        '627-id-4',
        '7054-id-2',
        '198-id-1',
        '252-id-4',
        '255-id-4',
        '258-id-4',
        '848-id-4',
        '177-id-4'
        // '371-id-2', //7岛首次限时出现
        // '557-id-2', //7岛首次限时出现
        // '328-id-2' //7岛首次限时出现
        // '364-id-2', // 圣诞佳节限定
        // '459-id-4', // 圣诞佳节限定
        // '147-id-4', // 新年2025限定1，迷你龙
        // '759-id-2' // 新年2025限定1，童偶熊
      ]
    },
    {
      'name': '高级2',
      'nameIndex': 2,
      'nameId': 3,
      'energy': 93540,
      'sleepStyles': [
        '52-id-3',
        '75-id-2',
        '70-id-4',
        '105-id-4',
        '180-id-4',
        '317-id-4',
        '454-id-4',
        '115-id-1',
        '127-id-1',
        '214-id-1',
        '359-id-1',
        '288-id-2',
        '702-id-1',
        '907-id-1',
        '253-id-1',
        '256-id-1',
        '259-id-1',
        // '304-id-4', // 新年2025限定2
        // '403-id-4', // 新年2025限定2
        // '736-id-4', // 新年2025限定2
        '425-id-2'
        // '371-id-4', //7岛首次限时出现
        // '557-id-4', //7岛首次限时出现
        // '328-id-4' //7岛首次限时出现
        // '922-id-1'
        // '759-id-4' // 新年2025限定1，童偶熊
        // '364-id-4' // 圣诞佳节限定
      ]
    },
    {
      'name': '高级3',
      'nameIndex': 3,
      'nameId': 3,
      'energy': 109130,
      'sleepStyles': [
        '2-id-2',
        '8-id-2',
        '5-id-2',
        '75-id-4',
        '24-id-2',
        '20-id-2',
        '93-id-2',
        '57-id-2',
        '176-id-2',
        '288-id-4',
        '225-id-1',
        '764-id-1',
        '153-id-2',
        '156-id-2',
        '159-id-2'
      ]
    },
    {
      'name': '高级4',
      'nameIndex': 4,
      'nameId': 3,
      'energy': 125032,
      'sleepStyles': [
        '2-id-4',
        '8-id-4',
        '5-id-4',
        '51-id-2',
        '24-id-4',
        '20-id-4',
        '57-id-4',
        '85-id-2',
        '132-id-2',
        '176-id-4',
        '153-id-4',
        '156-id-4',
        '159-id-4',
        '628-id-1',
        '178-id-1'
      ]
    },
    {
      'name': '高级5',
      'nameIndex': 5,
      'nameId': 3,
      'energy': 156121,
      'sleepStyles': [
        '12-id-1',
        '80-id-2',
        '53-id-2',
        '85-id-4',
        '132-id-5',
        '132-id-4',
        '354-id-1',
        '215-id-2',
        '113-id-1',
        '198-id-2',
        '311-id-1',
        '312-id-1'
      ]
    },
    {
      'name': '大师1',
      'nameIndex': 1,
      'nameId': 4,
      'energy': 187832,
      'sleepStyles': [
        '11-id-3',
        '80-id-4',
        '53-id-4',
        '115-id-2',
        '127-id-2',
        '214-id-2',
        '359-id-2',
        '702-id-2',
        '37-id-4',
        '38-id-1',
        '845-id-1',
        '907-id-2',
        '194-id-4',
        '195-id-1',
        // '94-id-1',
        '215-id-4',
        '7054-id-4',
        '198-id-4',
        '253-id-2',
        '256-id-2',
        '259-id-2',
        '710-id-4'
        // '7006-id-4',
        // '922-id-2'
      ]
    },
    {
      'name': '大师2',
      'nameIndex': 2,
      'nameId': 4,
      'energy': 220177,
      'sleepStyles': [
        '40-id-1',
        '71-id-1',
        '82-id-3',
        '115-id-4',
        '127-id-4',
        '214-id-4',
        '359-id-4',
        '225-id-2',
        '702-id-4',
        '764-id-2',
        '907-id-4',
        '778-id-1',
        '980-id-1',
        '253-id-4',
        '256-id-4',
        '259-id-4'
        // '922-id-4'
        // '365-id-1', // 圣诞佳节限定
        // '460-id-1' // 圣诞佳节限定
      ]
    },
    {
      'name': '大师3',
      'nameIndex': 3,
      'nameId': 4,
      'energy': 253169,
      'sleepStyles': [
        '700-id-1',
        '36-id-1',
        '225-id-4',
        '764-id-4',
        '628-id-2',
        '303-id-1',
        '83-id-1',
        '178-id-2'
      ]
    },
    {
      'name': '大师4',
      'nameIndex': 4,
      'nameId': 4,
      'energy': 286821,
      'sleepStyles': [
        '12-id-2',
        '26-id-1',
        '354-id-2',
        '628-id-4',
        '113-id-2',
        '311-id-2',
        '312-id-2',
        '178-id-4'
        // '426-id-1'
      ]
    },
    {
      'name': '大师5',
      'nameIndex': 5,
      'nameId': 4,
      'energy': 321146,
      'sleepStyles': [
        '12-id-4',
        '3-id-1',
        '9-id-1',
        '6-id-1',
        '132-id-3',
        '135-id-1',
        '470-id-1',
        '354-id-4',
        '154-id-1',
        '157-id-1',
        '160-id-1',
        '134-id-1',
        '136-id-1',
        '196-id-1',
        '197-id-1',
        '471-id-1',
        '38-id-2',
        '845-id-2',
        '195-id-2',
        '113-id-4',
        '311-id-4',
        '312-id-4'
      ]
    },
    {
      'name': '大师6',
      'nameIndex': 6,
      'nameId': 4,
      'energy': 356158,
      'sleepStyles': [
        '40-id-2',
        '53-id-3',
        '71-id-2',
        '468-id-1',
        '38-id-4',
        '845-id-4',
        '195-id-4',
        '778-id-2',
        '980-id-2'
        // '365-id-2', // 圣诞佳节限定
        // '460-id-2' // 圣诞佳节限定
      ]
    },
    {
      'name': '大师7',
      'nameIndex': 7,
      'nameId': 4,
      'energy': 391870,
      'sleepStyles': [
        '40-id-4',
        '71-id-4',
        '700-id-2',
        '289-id-1',
        '462-id-1',
        '36-id-2',
        '908-id-1',
        '115-id-3',
        '127-id-3',
        '214-id-3',
        '778-id-4',
        '980-id-4',
        '518-id-1',
        '242-id-1',
        '430-id-1',
        '303-id-2',
        '83-id-2',
        '254-id-1',
        '257-id-1',
        '260-id-1',
        '849-id-1',
        '8001-id-1',
        '711-id-1'
        // '7007-id-1'
        // '911-id-1',
        // '365-id-4' // 圣诞佳节限定
      ]
    },
    {
      'name': '大师8',
      'nameIndex': 8,
      'nameId': 4,
      'energy': 428296,
      'sleepStyles': [
        '26-id-2',
        '700-id-4',
        '36-id-4',
        '303-id-4',
        '225-id-3',
        '764-id-3',
        '83-id-4'
        // '94-id-2',
        // '426-id-2'
      ]
    },
    {
      'name': '大师9',
      'nameIndex': 9,
      'nameId': 4,
      'energy': 465451,
      'sleepStyles': [
        '3-id-2',
        '9-id-2',
        '6-id-2',
        '26-id-4',
        '135-id-2',
        '243-id-1',
        '154-id-2',
        '157-id-2',
        '160-id-2',
        '134-id-2',
        '136-id-2',
        '196-id-2',
        '197-id-2',
        '470-id-2',
        '471-id-2',
        '244-id-1',
        '245-id-1',
        '461-id-1',
        '488-id-1',
        '628-id-3'
        // '923-id-1'
        // '94-id-4'
      ]
    },
    {
      'name': '大师10',
      'nameIndex': 10,
      'nameId': 4,
      'energy': 532707,
      'sleepStyles': [
        '12-id-3',
        '3-id-4',
        '9-id-4',
        '6-id-4',
        '135-id-4',
        '468-id-2',
        '154-id-4',
        '157-id-4',
        '160-id-4',
        '134-id-4',
        '136-id-4',
        '196-id-4',
        '197-id-4',
        '470-id-4',
        '471-id-4'
      ]
    },
    {
      'name': '大师11',
      'nameIndex': 11,
      'nameId': 4,
      'energy': 601308,
      'sleepStyles': [
        '468-id-4',
        '289-id-2',
        '462-id-2',
        '908-id-2',
        '845-id-3',
        '461-id-2',
        '518-id-2',
        '242-id-2',
        '430-id-2',
        '845-id-3',
        '254-id-2',
        '257-id-2',
        '260-id-2',
        '849-id-2',
        '8001-id-2',
        '711-id-2'
        // '7007-id-2'
        // '911-id-2'
      ]
    },
    {
      'name': '大师12',
      'nameIndex': 12,
      'nameId': 4,
      'energy': 742056,
      'sleepStyles': [
        '289-id-4',
        '908-id-4',
        '461-id-4',
        '242-id-4',
        '430-id-4',
        '254-id-4',
        '257-id-4',
        '260-id-4',
        '849-id-4',
        '8001-id-4',
        '711-id-4'
        // '7007-id-4'
        // '911-id-4'
      ]
    },
    {
      'name': '大师13',
      'nameIndex': 13,
      'nameId': 4,
      'energy': 885619,
      'sleepStyles': [
        '700-id-3',
        '243-id-2',
        '244-id-2',
        '245-id-2',
        '488-id-2'
        // '923-id-2'
      ]
    },
    {
      'name': '大师14',
      'nameIndex': 14,
      'nameId': 4,
      'energy': 1029700,
      'sleepStyles': [
        '26-id-3'
        // '923-id-4'
      ]
    },
    {
      'name': '大师15',
      'nameIndex': 15,
      'nameId': 4,
      'energy': 1199506,
      'sleepStyles': [
        '135-id-3',
        '3-id-3',
        '6-id-3',
        '9-id-3',
        '154-id-3',
        '157-id-3',
        '160-id-3'
      ]
    },
    {
      'name': '大师16',
      'nameIndex': 16,
      'nameId': 4,
      'energy': 1486800,
      'sleepStyles': [
        '468-id-3'
      ]
    },
    {
      'name': '大师17',
      'nameIndex': 17,
      'nameId': 4,
      'energy': 1795052,
      'sleepStyles': [
        '462-id-3',
        '289-id-3'
      ]
    },
    {
      'name': '大师18',
      'nameIndex': 18,
      'nameId': 4,
      'energy': 2165541,
      'sleepStyles': []
    },
    {
      'name': '大师19',
      'nameIndex': 19,
      'nameId': 4,
      'energy': 2604280,
      'sleepStyles': [
        '243-id-3',
        '244-id-3',
        '245-id-3',
        '488-id-3'
      ]
    },
    {
      'name': '大师20',
      'nameIndex': 20,
      'nameId': 4,
      'energy': 3245795,
      'sleepStyles': [
      ]
    }
  ]
}