export default {
  lang: '中文',
  'ILAND': {
    'green': '萌绿之岛',
    'beach': '天青沙滩',
    'hole': '灰褐洞窟',
    'snow': '白花雪原',
    'lake': '宝蓝湖畔',
    'none': '未适正树果'
  },
  'PAGE_SLEEPCALC': {
    'titleCutNum': '数据区间参考'
  },
  'SLEEP_TYPES': {
    999: '沒有特徵',
    1: '淺淺入夢',
    2: '安然入睡',
    3: '深深入眠'
  },
  'BERRY_TYPES' : {
    1: '橙橙果',
    2: '靛莓果',
    3: '番荔果',
    4: '金枕果',
    5: '零餘果',
    6: '芒芒果',
    7: '莓莓果',
    8: '墨莓果',
    9: '木子果',
    10: '蘋野果',
    11: '柿仔果',
    12: '桃桃果',
    13: '萄葡果',
    14: '文柚果',
    15: '勿花果',
    16: '椰木果',
    17: '異奇果',
    18: '櫻子果'
  }
}