export default {
  lang: '日本語',
  'ILAND': {
    'green': 'ワカクサ本島',
    'beach': 'シアンの砂浜',
    'hole': 'トープ洞窟',
    'snow': 'ウノハナ雪原',
    'lake': 'ラピスラズリ湖畔',
    'none': '未适正树果'
  },
  'PAGE_SLEEPCALC': {
    'titleCutNum': '睡眠リサーチのポケモン数'
  },
  'SLEEP_TYPES': {
    999: '沒有特徵',
    1: 'うとうと',
    2: 'すやすや',
    3: 'ぐっすり'
  },
  'BERRY_TYPES': {
    1: 'オレンのみ',
    2: 'ベリブのみ',
    3: 'ヤチェのみ',
    4: 'ドリのみ',
    5: 'カゴのみ',
    6: 'マゴのみ',
    7: 'チーゴのみ',
    8: 'ブリーのみ',
    9: 'ラムのみ',
    10: 'ヒメリのみ',
    11: 'キーのみ',
    12: 'モモンのみ',
    13: 'ウブのみ',
    14: 'オボンのみ',
    15: 'フィラのみ',
    16: 'シーヤのみ',
    17: 'ウイのみ',
    18: 'クラボのみ'
  }
}