const markdownText = `
# 更新日志

## 24-02-06
1. add 50级一天树果能量排行页面

## 24-02-05
1. update 岛屿数据区间参考
2. update 补充全图鉴数据
3. update 帮忙速度计算&食材宝可梦推荐页面视觉样式

## 24-02-04
1. add 帮忙速度计算的对比进度条
2. update 食材宝可梦推荐攻略

## 24-02-02
1. add 帮忙速度计算器
2. update 导航视觉样式

## 24-01-31
1. add 捐赠弹窗
2. add 全图鉴技能分类查询
3. add 最新宝可梦因类型不同会显示技能信息

## 24-01-30
1. add 全图鉴树果分类查询
2. update 视觉样式
3. update 岛屿数据区间参考

## 24-01-29
1. add 全图鉴帮忙速度分类查询
2. update 岛屿数据区间参考
3. update 全图鉴帮忙速度

## 24-01-27
1. add 计算睡眠之力的地图选择显示对应树果
2. add 显示对应树果宝可梦
3. add 显示掉活力
4. add 全图鉴页(数据待完善)
5. add 食材宝可梦推荐关联食谱
6. update 岛屿数据区间参考
7. fix 部分情况下最新宝可梦显示正序

## 24-01-26
1. add 5岛计算
2. add 1月最新宝可梦
3. update 岛屿数据区间参考
4. update 最新食材推荐

## 24-01-20
1. update 优化性能

## 24-01-18
1. add 最新宝可梦因类型不同会显示树果、帮忙速度等信息
2. update 视觉样式

## 24-01-12
1. add 食材宝可梦推荐会显示该宝可梦全食材
2. add 最新宝可梦显示类型

## 24-01-03
1. add 导航&分页
2. add 食材宝可梦推荐

## 23-12-25
1. add 满月日2倍、2.5倍、3倍
2. fix 部分情况下最新宝可梦显示正序

## 23-12-20
1. update 视觉样式

## 23-12-19
1. update 最新宝可梦对应图片显示

## 23-12-14
1. add 最新宝可梦记录

## 23-12-12
1. add 网站图标&SEO优化
2. add 距离抓多一只还需多少能量的提示

## 23-12-10
1. add 让睡眠得分更好看
2. update 视觉样式
3. update 页尾信息

## 23-12-05
1. fix 百花雪原的拆分只数计算错误bug
2. fix 某些时候会显示60分钟的bug
3. fix 某些时候会按3只拆分的bug
4. update 视觉样式

## 23-12-04
1. update 按只数拆分功能重新上线
2. update 优化代码

## 23-12-03
1. fix 计算睡眠分错误
2. update 最新的只数数据表
3. update 部分文案
4. update 视觉样式

## 23-12-01
1. update 按只数拆分功能下线

## 23-11-30
1. add 按只数拆分功能
2. update 调整部分文案描述

## 23-11-27
1. add 显示睡眠得分
2. fix 拆分2觉部分计算不正确

## 23-11-26
1. add 特殊日子加成计算

## 23-11-25
1. add 上线

`
export default markdownText