export const foodRecommend = {
  creatTime: 1704265513672,
  updateTime: 1707022194264,
  appVer: '1.1.0',
  list: [
    {
      evoLine: [1, 2, 3],
      needFood: [[9], [9, 12], [9, 4]],
      desc: '对应饮料周所需的蜜，高级料理的番茄，一般来说不缺番茄，如果真要番茄还是喇叭芽好点。'
    },
    {
      evoLine: [4, 5, 6],
      needFood: [[7], [7, 11], [6, 11]],
      desc: '对应含玉米高级料理需要肠、姜'
    },
    {
      evoLine: [7, 8, 9],
      needFood: [[8], [13], [13, 8]],
      desc: '对应大部分牛奶料理以及55料理所需的可可，如有伊布家族不考虑60奶'
    },
    {
      evoLine: [50, 51],
      needFood: [[12], [1], [1]],
      desc: '唯一lv30产葱最快的食材型，比百变怪快'
    },
    {
      evoLine: [69, 70, 71],
      needFood: [[12], [4, 12], [4, 1]],
      desc: '番茄土豆适配咖喱周'
    },
    {
      evoLine: [74, 75, 76],
      needFood: [[15], [4], [4]],
      desc: '对应高级料理的土豆'
    },
    {
      evoLine: [79, 80, 199],
      needFood: [[13], [14], [14]],
      desc: '它不是食材型是技能型！选个up exp的性格养，30唯一有尾巴，解锁完尾巴就行！目前活力机制下呆呆王技能可用。'
    },
    {
      evoLine: [92, 93, 94],
      needFood: [[6], [2, 6], [2,10]],
      desc: '无加成得食材率有限，大部分时候会下树果'
    },
    {
      evoLine: [115],
      needFood: [[11], [4, 11], [4, 11]],
      desc: '针对玉米料理所需的姜，30土豆有其它可养成'
    },
    {
      evoLine: [439, 122],
      needFood: [[12], [4], [1, 4]],
      desc: '低替喇叭芽，糖果特别少'
    },
    {
      evoLine: [127],
      needFood: [[9], [9, 5], [9, 5]],
      desc: '对应饮料甜品周，蜜建议抓种子，苹果建议抓灾兽、信使鸟'
    },
    {
      evoLine: [132],
      needFood: [[10], [1], [1, 14]],
      desc: '帮忙速度拉，还小口袋'
    },
    {
      evoLine: [225],
      needFood: [[3], [3, 5], [3, 5]],
      desc: '有别的产苹果就选lv30蛋，建议抓加食材概率的。'
    },
    {
      evoLine: [246, 247, 248],
      needFood: [[11], [11, 15], [15, 11]],
      desc: '对应高级料理，不推荐新人抓&养，成本巨大，41级才3进'
    },
    {
      evoLine: [359],
      needFood: [[13], [5], [13, 5]],
      desc: '对应饮料甜品周苹果'
    },
    {
      evoLine: [453, 454],
      needFood: [[10], [10], [10]],
      desc: '一般不养，对应沙拉周油，帮忙速度拉，实在没别的油候补再养他'
    },
    {
      evoLine: [459, 460],
      needFood: [[12], [3], [3, 2]],
      desc: '少数产蛋的食材型，建议抓加帮忙速度的。'
    },
    {
      evoLine: [147, 148, 149],
      needFood: [[6], [6], [6, 16, 10]],
      desc: '同小班全家一样的1.5倍育成经验。要玉米找穿着熊。'
    },
    {
      evoLine: [759, 760],
      needFood: [[16], [16], [3, 16]],
      desc: '玉米最重要的来源之一。可以考虑3玉米，双肠找喷火龙。'
    }
  ]
}