const pokedex = {
  1: {
    name: '妙蛙種子'
  },
  2: {
    name: '妙蛙草'
  },
  3: {
    name: '妙蛙花'
  },
  4: {
    name: '小火龍'
  },
  5: {
    name: '火恐龍'
  },
  6: {
    name: '噴火龍'
  },
  7: {
    name: '傑尼龜'
  },
  8: {
    name: '卡咪龜'
  },
  9: {
    name: '水箭龜'
  },
  10: {
    name: '綠毛蟲'
  },
  11: {
    name: '鐵甲蛹'
  },
  12: {
    name: '巴大蝶'
  },
  19: {
    name: '小拉達'
  },
  20: {
    name: '拉達'
  },
  23: {
    name: '阿柏蛇'
  },
  24: {
    name: '阿柏怪'
  },
  25: {
    name: '皮卡丘'
  },
  26: {
    name: '雷丘'
  },
  35: {
    name: '皮皮'
  },
  36: {
    name: '皮可西'
  },
  39: {
    name: '胖丁'
  },
  40: {
    name: '胖可丁'
  },
  50: {
    name: '地鼠'
  },
  51: {
    name: '三地鼠'
  },
  52: {
    name: '喵喵'
  },
  53: {
    name: '貓老大'
  },
  54: {
    name: '可達鴨'
  },
  55: {
    name: '哥達鴨'
  },
  56: {
    name: '猴怪'
  },
  57: {
    name: '火爆猴'
  },
  58: {
    name: '卡蒂狗'
  },
  59: {
    name: '風速狗'
  },
  69: {
    name: '喇叭芽'
  },
  70: {
    name: '口呆花'
  },
  71: {
    name: '大食花'
  },
  74: {
    name: '小拳石'
  },
  75: {
    name: '隆隆石'
  },
  76: {
    name: '隆隆岩'
  },
  79: {
    name: '呆呆獸'
  },
  80: {
    name: '呆殼獸'
  },
  81: {
    name: '小磁怪'
  },
  82: {
    name: '三合一磁怪'
  },
  84: {
    name: '嘟嘟'
  },
  85: {
    name: '嘟嘟利'
  },
  92: {
    name: '鬼斯'
  },
  93: {
    name: '鬼斯通'
  },
  94: {
    name: '耿鬼'
  },
  95: {
    name: '大岩蛇'
  },
  104: {
    name: '卡拉卡拉'
  },
  105: {
    name: '嘎啦嘎啦'
  },
  115: {
    name: '袋獸'
  },
  122: {
    name: '魔牆人偶'
  },
  127: {
    name: '凱羅斯'
  },
  132: {
    name: '百變怪'
  },
  133: {
    name: '伊布'
  },
  134: {
    name: '水伊布'
  },
  135: {
    name: '雷伊布'
  },
  136: {
    name: '火伊布'
  },
  147: {
    name: '迷你龍'
  },
  148: {
    name: '哈克龍'
  },
  149: {
    name: '快龍'
  },
  152: {
    name: '菊草葉'
  },
  153: {
    name: '月桂葉'
  },
  154: {
    name: '大竺葵'
  },
  155: {
    name: '火球鼠'
  },
  156: {
    name: '火岩鼠'
  },
  157: {
    name: '火爆獸'
  },
  158: {
    name: '小鋸鱷'
  },
  159: {
    name: '藍鱷'
  },
  160: {
    name: '大力鱷'
  },
  172: {
    name: '皮丘'
  },
  173: {
    name: '皮寶寶'
  },
  174: {
    name: '寶寶丁'
  },
  175: {
    name: '波克比'
  },
  176: {
    name: '波克基古'
  },
  179: {
    name: '咩利羊'
  },
  180: {
    name: '茸茸羊'
  },
  181: {
    name: '電龍'
  },
  185: {
    name: '樹才怪'
  },
  196: {
    name: '太陽伊布'
  },
  197: {
    name: '月亮伊布'
  },
  199: {
    name: '呆呆王'
  },
  202: {
    name: '果然翁'
  },
  208: {
    name: '大鋼蛇'
  },
  214: {
    name: '赫拉克羅斯'
  },
  225: {
    name: '信使鳥'
  },
  228: {
    name: '戴魯比'
  },
  229: {
    name: '黑魯加'
  },
  246: {
    name: '幼基拉斯'
  },
  247: {
    name: '沙基拉斯'
  },
  248: {
    name: '班基拉斯'
  },
  287: {
    name: '懶人獺'
  },
  288: {
    name: '過動猿'
  },
  289: {
    name: '請假王'
  },
  302: {
    name: '勾魂眼'
  },
  316: {
    name: '溶食獸'
  },
  317: {
    name: '吞食獸'
  },
  333: {
    name: '青綿鳥'
  },
  334: {
    name: '七夕青鳥'
  },
  353: {
    name: '怨影娃娃'
  },
  354: {
    name: '詛咒娃娃'
  },
  359: {
    name: '阿勃梭魯'
  },
  360: {
    name: '小果然'
  },
  363: {
    name: '海豹球'
  },
  364: {
    name: '海魔獅'
  },
  365: {
    name: '帝牙海獅'
  },
  438: {
    name: '盆才怪'
  },
  439: {
    name: '魔尼尼'
  },
  447: {
    name: '利歐路'
  },
  448: {
    name: '路卡利歐'
  },
  453: {
    name: '不良蛙'
  },
  454: {
    name: '毒骷蛙'
  },
  459: {
    name: '雪笠怪'
  },
  460: {
    name: '暴雪王'
  },
  462: {
    name: '自爆磁怪'
  },
  468: {
    name: '波克基斯'
  },
  470: {
    name: '葉伊布'
  },
  471: {
    name: '冰伊布'
  },
  700: {
    name: '仙子伊布'
  },
  9001: {
    name: '皮卡丘（萬聖節）'
  },
  9002: {
    name: '皮卡丘（佳節）'
  }
}
const updatePoke = [{
  time: '2023/8/1',
  pokemons: [439, 122]
}, {
  time: '2023/9/1',
  pokemons: [173, 35, 36]
}, {
  time: '2023/10/1',
  pokemons: [353, 354, 9001]
}, {
  time: '2023/11/1',
  pokemons: [95, 208]
}, {
  time: '2023/12/1',
  pokemons: [225, 459, 460, 9002]
}]
export {
  pokedex,
  updatePoke
}