export const NATURE = {
  1: {
    id: '怕寂寞',
    up: '幫忙速度',
    down: '活力回復量'
  },
  2: {
    id: '固執',
    up: '幫忙速度',
    down: '食材發現率'
  },
  3: {
    id: '頑皮',
    up: '幫忙速度',
    down: '主技能發動機率'
  },
  4: {
    id: '勇敢',
    up: '幫忙速度',
    down: 'EXP獲得量'
  },
  5: {
    id: '大膽',
    up: '活力回復量',
    down: '幫忙速度'
  },
  6: {
    id: '淘氣',
    up: '活力回復量',
    down: '食材發現率'
  },
  7: {
    id: '樂天',
    up: '活力回復量',
    down: '主技能發動機率'
  },
  8: {
    id: '悠閒',
    up: '活力回復量',
    down: 'EXP獲得量'
  },
  9: {
    id: '內斂',
    up: '食材發現率',
    down: '幫忙速度'
  },
  10: {
    id: '慢吞吞',
    up: '食材發現率',
    down: '活力回復量'
  },
  11: {
    id: '馬虎',
    up: '食材發現率',
    down: '主技能發動機率'
  },
  12: {
    id: '冷靜',
    up: '食材發現率',
    down: 'EXP獲得量'
  },
  13: {
    id: '溫和',
    up: '主技能發動機率',
    down: '幫忙速度'
  },
  14: {
    id: '溫順',
    up: '主技能發動機率',
    down: '活力回復量'
  },
  15: {
    id: '慎重',
    up: '主技能發動機率',
    down: '食材發現率'
  },
  16: {
    id: '自大',
    up: '主技能發動機率',
    down: 'EXP獲得量'
  },
  17: {
    id: '膽小',
    up: 'EXP獲得量',
    down: '幫忙速度'
  },
  18: {
    id: '急躁',
    up: 'EXP獲得量',
    down: '活力回復量'
  },
  19: {
    id: '爽朗',
    up: 'EXP獲得量',
    down: '食材發現率'
  },
  20: {
    id: '天真',
    up: 'EXP獲得量',
    down: '主技能發動機率'
  },
  21: {
    id: '害羞'
  },
  22: {
    id: '勤奮'
  },
  23: {
    id: '坦率'
  },
  24: {
    id: '浮躁'
  },
  25: {
    id: '認真'
  }
}