export const POKE_TYPES = {
  1: '树果',
  2: '食材',
  3: '技能'
}
export const FOOD_TYPES = {
  1: '粗枝大蔥',
  2: '品鮮蘑菇',
  3: '特選蛋',
  4: '窩心洋芋',
  5: '特選蘋果',
  6: '火辣香草',
  7: '豆製肉',
  8: '哞哞鮮奶',
  9: '甜甜蜜',
  10: '純粹油',
  11: '暖暖薑',
  12: '好眠番茄',
  13: '放鬆可可',
  14: '美味尾巴',
  15: '萌綠大豆',
  16: '萌綠玉米'
}
export const BERRY_TYPES = {
  1: '橙橙果',
  2: '靛莓果',
  3: '番荔果',
  4: '金枕果',
  5: '零餘果',
  6: '芒芒果',
  7: '莓莓果',
  8: '墨莓果',
  9: '木子果',
  10: '蘋野果',
  11: '柿仔果',
  12: '桃桃果',
  13: '萄葡果',
  14: '文柚果',
  15: '勿花果',
  16: '椰木果',
  17: '異奇果',
  18: '櫻子果'
}