export const foodRecommend = {
  creatTime: 1704265513672,
  updateTime: 1750689844933,
  appVer: '2.9.0',
  list: [
    {
      evoLine: [1, 2, 3],
      needFood: [[9], [9, 12], [9, 4]],
      desc: '对应饮料周所需的蜜，高级料理的番茄，一般来说不缺番茄，如果真要番茄还是喇叭芽好点。'
    },
    {
      evoLine: [4, 5, 6],
      needFood: [[7], [7, 11], [6, 7, 11]],
      desc: '对应含玉米高级料理需要肠、姜'
    },
    {
      evoLine: [7, 8, 9],
      needFood: [[8], [8, 13], [13, 8]],
      desc: '对应大部分牛奶料理以及料理所需的可可，如有伊布家族不考虑60奶'
    },
    {
      evoLine: [50, 51],
      needFood: [[12], [1], [1]],
      desc: '产葱副手'
    },
    {
      evoLine: [69, 70, 71],
      needFood: [[12], [4, 12], [12, 4, 1]],
      desc: '番茄土豆适配咖喱周'
    },
    {
      evoLine: [74, 75, 76],
      needFood: [[15], [4], [4]],
      desc: '对应高级料理的土豆'
    },
    {
      evoLine: [79, 80, 199],
      needFood: [[13], [14], [14]],
      desc: '它不是食材型是技能型！选个up exp的性格养，30唯一有尾巴，解锁完尾巴就行！目前活力机制下呆呆王技能可用。'
    },
    {
      evoLine: [92, 93, 94],
      needFood: [[6], [2, 6], [2, 6]],
      desc: '无加成得食材率有限，大部分时候会下树果'
    },
    {
      evoLine: [115],
      needFood: [[11], [4, 11], [4, 11]],
      desc: '针对玉米料理所需的姜，30土豆有其它可养成'
    },
    {
      evoLine: [439, 122],
      needFood: [[12], [4], [1, 4]],
      desc: '低替喇叭芽，糖果特别少'
    },
    {
      evoLine: [127],
      needFood: [[9], [9, 5], [9, 5]],
      desc: '对应饮料甜品/沙拉周，蜜建议抓种子，苹果也可以抓灾兽、信使鸟'
    },
    {
      evoLine: [132],
      needFood: [[10], [1], [1, 14]],
      desc: '帮忙速度拉，还小口袋'
    },
    {
      evoLine: [225],
      needFood: [[3], [3, 5], [3, 5]],
      desc: '有别的产苹果就选lv30蛋，建议抓加食材概率的。'
    },
    {
      evoLine: [246, 247, 248],
      needFood: [[11], [11, 15], [15, 11]],
      desc: '对应高级料理，不推荐新人抓&养，成本巨大，41级才3进'
    },
    {
      evoLine: [359],
      needFood: [[13], [5, 13], [13, 5]],
      desc: '对应饮料甜品周苹果'
    },
    {
      evoLine: [453, 454],
      needFood: [[10], [10], [10]],
      desc: '对应沙拉周油，帮忙速度拉，推荐帮忙M起步'
    },
    {
      evoLine: [459, 460],
      needFood: [[12], [3], [3]],
      desc: '少数产蛋的食材型，建议抓加帮忙速度的。'
    },
    {
      evoLine: [147, 148, 149],
      needFood: [[6], [6, 16], [6, 16]],
      desc: '同小班全家一样的1.5倍育成经验。要玉米找穿着熊。'
    },
    {
      evoLine: [759, 760],
      needFood: [[16], [16, 7], [16, 7]],
      desc: '玉米最重要的来源之一。可以考虑3玉米，双肠找喷火龙（60肠可以直接淘汰肠龙）。'
    },
    {
      evoLine: [764],
      needFood: [[16], [16, 11], [16, 11]],
      desc: '除非真的去不了5岛又急需玉米才抓他，需至少2食材概率起步否则痛不欲生，等上修。玉米不如5岛熊，姜不如大班或者喷火龙。'
    },
    {
      evoLine: [845],
      needFood: [[10], [10], [10]],
      desc: '白板30产油基本跟蛙持平，不过食材率不如蛙高，技能太优秀了，非要土豆的话不如隆隆岩和大食花。'
    },
    {
      evoLine: [906, 907, 908],
      needFood: [[4], [4], [4]],
      desc: '双食材起步，其它不如奶龟。'
    },
    {
      evoLine: [909, 910, 911],
      needFood: [[5], [5], [5]],
      desc: '游戏第一个基础食材为苹果的，自带高食材率和技能率。肠去左转找喷火龙和肠熊。伪自回准神。'
    },
    {
      evoLine: [912, 913, 914],
      needFood: [[15], [15, 1], [15, 1]],
      desc: '抓aaa，abb，高食材率的产葱怪（60见真章），豆子跟隆隆石基本持平，目前豆子料理没啥用。'
    },
    {
      evoLine: [194, 195],
      needFood: [[2], [2], [2]],
      desc: '伟大无需解释，蘑菇真神。'
    },
    {
      evoLine: [304, 305, 306],
      needFood: [[7], [7, 17], [7, 17]],
      desc: '新肠手，咖啡豆副C位'
    },
    {
      evoLine: [403, 404, 405],
      needFood: [[12], [12, 10], [12, 10]],
      desc: '新油手，凑合番茄手'
    },
    {
      evoLine: [736, 737, 738],
      needFood: [[17], [17, 2], [17, 2]],
      desc: '咖啡主C位'
    },
    {
      evoLine: [303],
      needFood: [[10], [10], [10]],
      desc: '没啥卵用的油手，真不如古月鸟，玉米不如熊神'
    },
    {
      evoLine: [440, 113, 242],
      needFood: [[3], [3], [3]],
      desc: '鸡蛋主C位，真神'
    },
    {
      evoLine: [83],
      needFood: [[1], [1], [1]],
      desc: '葱主C位'
    }
  ]
}